RSN/src/InformationRegisters/ПереданныеМастерданные/ПереданныеМастерданные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПереданныеМастерданные</name>
  <resources>
    <name>ИдентификаторПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ПередачаМастерданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ПереданныеМастерданные/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Узел, ОбъектМетаданных, Идентификатор, ИдентификаторПриемника) Экспорт
	
	Менеджер = РегистрыСведений.ПереданныеМастерданные.СоздатьМенеджерЗаписи();
	
	Менеджер.Узел = Узел;
	Менеджер.ОбъектМетаданных = ОбъектМетаданных;
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.ИдентификаторПриемника = ИдентификаторПриемника;
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
